Программа получает на вход число от пользователя и по определённым условиям выдаёт разные ответы для кусочно заданной функции
Подключаем библиотеки: 
пространство имён using namespace std(содержит функции, классы и объекты); 
#include <iostream> (ввод/вывод); 
#include <iomanip> помогает сделать форматированный вывод с помощью методов fixed << setprecision(n), где n - количество знаков; 
#include <cmath> это математические функции(sin, cos и т.д_
#include <algorithm> она используется для замены старого значения новым в заданном диапазоне контейнера. Пример функции //replace(inputStr.begin(), inputStr.end(), ',', '.');
#include <string> позволяет использовать динамическое управление памятью, простоту использования и встроенные функции класса string
#include <limits> оказалась ненужной в данной реализации программы, вследствии чего была удалена

Мы задаём переменную x, флаг input, строку inputStr, а также символ symb = '.'
После циклом while мы запрашиваем ввод от пользователя
Методом replace мы сканируем от начала и до конца введённую строку и заменяем запятые на точки
Далее помещаем переменную pos в size_t (это положительно заданный int, который может являться 0 и 1 насколько я понял)
После ранее объявленной переменной x мы присваиваем значение, получаемое из метода stod, которое принимает строку и переобразовывает с помощью второго компонента в число
Символ «*» пишется перед именем указателя и возвращает ссылку на переменную этого типа, по которой можно писать и читать данные, как если бы это была обычная переменная.
Далее мы соотносим начало строки/числа с symb('.'), чтобы с точки не начиналось число
Обрабатываем по длине и сравниваем количество символов int с количеством символов в строке, если совпадение обнаружено, тогда флаг меняет на true
const exception& e — это конструкция в языке программирования C++, которая обозначает ссылку на объект исключения. 
cin.clear();
cin.ignore(numeric_limits<streamsize>::max(), '\n');
Обе строки используются в связке, первой строкой мы убираем флаг ошибки, после вторая строка очищает состояние потока ввода и игнорирует символы до символа новой строки.
numeric_limits это минимальные и максимальные значения, которые могут представлять разные числовые типы.
<streamsize>::max() это целочисленный тип со знаком, который используется для представления количества символов, переданных в ходе операции ввода-вывода, или размера буфера ввода-вывода.
max же указывает на максималньое количество передаваемых чисел
Далее проходит такая же валидация данных за исключением выбора 1,2,3 для функций(далее выбор всего остального автоматический)
cout << fixed << setprecision(6) << "Answer = " << answer;
Этими строками мы вывели фиксированный размер ответа, влючающий 6 знаков включая до и после запятой
return 0 вы возвращаем, если у нас всё отработало штатно
